{
    "architectures": ["LlamaForCausalLM"],
    "model_type": "llama",
    "hidden_size": 512,
    "num_hidden_layers": 6,
    "num_attention_heads": 8,
    "intermediate_size": 2048,
    "max_position_embeddings": 512,
    "vocab_size": 30522,
    "dropout": 0.1,
    "attention_dropout": 0.1
}
